olliw42/stm32ll-lib/src/stdstm32-uartf.h
#elif defined UARTF_USE_UART3 || defined UARTF_USE_UART3_PB10PB11 || defined UARTF_USE_UART3_PC10PC11 || defined UARTF_USE_UART3_PB8PB9 || \
      defined UARTF_USE_UART3_PA4PA3 || defined UARTF_USE_UART3_PB3PB8
  #define UARTF_UARTx             USART3
  #if defined UARTF_USE_UART3
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART3_PB10PB11
    #define UARTF_TX_IO           IO_PB10
    #define UARTF_RX_IO           IO_PB11
  #elif defined UARTF_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #elif defined UARTF_USE_UART3_PB8PB9 // only F3
    #define UARTF_TX_IO           IO_PB8
    #define UARTF_RX_IO           IO_PB9
  #elif defined UARTF_USE_UART3_PA4PA3 // only H5
    #define UARTF_TX_IO           IO_PA4
    #define UARTF_RX_IO           IO_PA3
  #elif defined UARTF_USE_UART3_PB3PB8 // only H5
    #define UARTF_TX_IO           IO_PB3
    #define UARTF_RX_IO           IO_PB8
  #else
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART3
      // user needs to specify UARTF_USE_IO_AF
    #elif defined defined UARTF_USE_UART3_PB10PB11 || defined UARTF_USE_UART3_PB8PB9
      #define UARTF_IO_AF         IO_AF_4
    #elif defined UARTF_USE_UART3_PC10PC11
      #define UARTF_IO_AF         IO_AF_1
    #else
      #error UARTF_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTF_IRQn              USART3_IRQn
  #define UARTF_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    #if defined STM32H5_H56x
      // H56x USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64
      #if defined UARTF_USE_UART3_PB10PB11
        #error UARTF_USE_UART3_PB10PB11 not bonded on STM32H56x packages up to LQFP64, PB11 is missing ! use UARTF_USE_UART3_PC10PC11
      #elif defined UARTF_USE_UART3_PB8PB9
        #error UARTF_USE_UART3_PB8PB9 not bonded on STM32H56x packages up to LQFP64, PB9 is missing ! use UARTF_USE_UART3_PC10PC11
      #elif defined UARTF_USE_UART3_PA4PA3 || defined UARTF_USE_UART3_PB3PB8
        #error UARTF_USE_UART3 mapping not available on STM32H56x ! use UARTF_USE_UART3_PC10PC11
      #endif
    #else
      // H503 USART3 is AF13 for the mappings reachable on the 48 pin package.
      // PB11 and PB9 do not exist on H503, and PC10/PC11 are not bonded on LQFP48.
      #if defined UARTF_USE_UART3_PA4PA3 || defined UARTF_USE_UART3_PB3PB8
        #undef UARTF_IO_AF
        #define UARTF_IO_AF       IO_AF_13
      #elif defined UARTF_USE_UART3_PB10PB11
        #error UARTF_USE_UART3_PB10PB11 not available on STM32H503, PB11 does not exist ! use UARTF_USE_UART3_PA4PA3 or UARTF_USE_UART3_PB3PB8
      #elif defined UARTF_USE_UART3_PB8PB9
        #error UARTF_USE_UART3_PB8PB9 not available on STM32H503, PB9 does not exist ! use UARTF_USE_UART3_PB3PB8
      #elif defined UARTF_USE_UART3_PC10PC11
        #error UARTF_USE_UART3_PC10PC11 not available on STM32H503 LQFP48, port C is not bonded !
      #endif
    #endif
  #endif

#elif defined UARTF_USE_UART4 || defined UARTF_USE_UART4_PC10PC11 || defined UARTF_USE_UART4_PA0PA1
  #define UARTF_UARTx             UART4
  #ifdef UARTF_USE_UART4
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART4_PC10PC11
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #elif defined UARTF_USE_UART4_PA0PA1 // only F7, H56x // was UART4_REMAPPED
    #define UARTF_TX_IO           IO_PA0
    #define UARTF_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #elif defined STM32H5_H56x
    #define UARTF_IO_AF           IO_AF_8
  #endif
  #define UARTF_IRQn              UART4_IRQn
  #define UARTF_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    // H56x has UART4 on PA0/PA1 and PC10/PC11, both AF8 and bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART4 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTF_USE_UART5 || defined UARTF_USE_UART5_PC12PD2
  #define UARTF_UARTx             UART5
  #ifdef UARTF_USE_UART5
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART5_PC12PD2
    #define UARTF_TX_IO           IO_PC12
    #define UARTF_RX_IO           IO_PD2
  #endif
  #define UARTF_IRQn              UART5_IRQn
  #define UARTF_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #elif defined STM32H5
    // H56x has UART5 on PC12/PD2, AF8 and bonded up to LQFP64
    #if defined STM32H5_H56x
      #define UARTF_IO_AF         IO_AF_8
    #else
      #error UART5 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTF_USE_UART6 || defined UARTF_USE_UART6_PC6PC7 || defined UARTF_USE_UART6_PG14PG9
  #define UARTF_UARTx             USART6
  #ifdef UARTF_USE_UART6
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART6_PC6PC7
    #define UARTF_TX_IO           IO_PC6
    #define UARTF_RX_IO           IO_PC7
  #elif defined UARTF_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTF_TX_IO           IO_PG14
    #define UARTF_RX_IO           IO_PG9
  #endif
  #define UARTF_IO_AF             IO_AF_8
  #define UARTF_IRQn              USART6_IRQn
  #define UARTF_IRQHandler        USART6_IRQHandler

