olliw42/stm32ll-lib/src/stdstm32-uartf.h
void uartf_puts(const char *s)
{
  while (*s) {
    uartf_putc(*s);
    s++;
  }
}


void uartf_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartf_putc(buf[i]);
}


#ifdef UARTF_USE_TX_ISR
uint16_t uartf_tx_notfull(void)
{
  uint16_t next = (uartf_txwritepos + 1) & UARTF_TXBUFSIZEMASK;
  return (uartf_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartf_tx_isempty(void)
{
  if (uartf_txwritepos == uartf_txreadpos) return 1;
  return 0;
}


static inline void uartf_tx_flush(void)
{
  uartf_txwritepos = uartf_txreadpos = 0;
}
#else
static inline void uartf_tx_flush(void) {}
#endif

#endif // defined UARTF_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTF_USE_RX

static inline uint16_t uartf_rx_available(void)
{
  if (uartf_rxwritepos == uartf_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartf_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartf_rxwritepos - (int16_t)uartf_rxreadpos;
  return (d < 0) ? d + (UARTF_RXBUFSIZEMASK + 1) : d;
}


char uartf_getc(void)
{
  while (uartf_rxwritepos == uartf_rxreadpos) {};
  uartf_rxreadpos = (uartf_rxreadpos + 1) & UARTF_RXBUFSIZEMASK;
  return uartf_rxbuf[uartf_rxreadpos];
}


void uartf_getbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) buf[i] = uartf_getc();
}


static inline char uartf_lookatnextc(void)
{
  return uartf_rxbuf[(uartf_rxreadpos + 1) & UARTF_RXBUFSIZEMASK];
}


static inline void uartf_rx_flush(void)
{
  uartf_rxwritepos = uartf_rxreadpos = 0;
}

#endif // defined UARTF_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartf_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTF_IS_LPUART)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4 || defined STM32H5
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTF_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UARTF_UARTx, &UART_InitStruct);
#endif
}


void uartf_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTF_IS_LPUART)
  LL_USART_Disable(UARTF_UARTx); // must be disabled to configure some registers
  _uartf_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTF_UARTx);
#else
  LL_LPUART_Disable(UARTF_UARTx); // must be disabled to configure some registers
  _uartf_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTF_UARTx);
#endif
}


void uartf_setbaudrate(uint32_t baud)
{
  uartf_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uartf_tx_enablepin(FunctionalState flag)
{
#ifdef UARTF_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTF_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTF_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTF_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartf_rx_enableisr(FunctionalState flag)
{
#ifdef UARTF_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
    LL_USART_ReceiveData8(UARTF_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTF_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTF_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
  }
#endif
}


void uartf_init_isroff(void)
{
  LL_USART_Disable(UARTF_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTF_UARTx);
#ifdef STM32F1
#if defined UARTF_USE_UART1_PB6PB7
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTF_USE_UART2_PD5PD6
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTF_USE_UART3_PC10PC11
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTF_USE_TX
  gpio_init_af(UARTF_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTF_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTF_USE_RX
#ifndef UARTF_INVERTED
  gpio_init_af(UARTF_RX_IO, IO_MODE_INPUT_PU, UARTF_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTF_RX_IO, IO_MODE_INPUT_PD, UARTF_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uartf_initprotocol(UARTF_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTF_IS_LPUART)
  LL_USART_ConfigAsyncMode(UARTF_UARTx);
#if defined STM32G4 || defined STM32H5
  LL_USART_DisableFIFO(UARTF_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTF_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTF_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTF_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTF_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTF_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

#ifdef UARTF_INVERTED
#ifdef UARTF_USE_TX
  LL_USART_SetTXPinLevel(UARTF_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTF_USE_RX
  LL_USART_SetRXPinLevel(UARTF_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTF_USE_RX || defined UARTF_USE_TX_ISR
#ifdef UARTF_PREEMPTIONPRIORITY
  #error Legacy UARTF_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTF_SUBPRIORITY
  #error Legacy UARTF_SUBPRIORITY used !
#endif
#ifdef UARTF_PRIORITY
#error Legacy UARTF_PRIORITY used !
#endif
#ifndef UARTF_IRQ_PRIORITY
  #define UARTF_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTF_IRQn, UARTF_IRQ_PRIORITY);
#endif

#ifdef UARTF_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTF_UARTx);
  LL_USART_DisableIT_TC(UARTF_UARTx);
  LL_USART_ClearFlag_TC(UARTF_UARTx);
  // Flush buffer
  uartf_txwritepos = uartf_txreadpos = 0;
#endif

#ifdef UARTF_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTF_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
  // Flush buffer
  uartf_rxwritepos = uartf_rxreadpos = 0;
#ifdef UARTF_USE_RXERRORCOUNT
  uartf_errorcnt_rxnoise = 0;
  uartf_errorcnt_rxframe = 0;
  uartf_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTF_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UARTF_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UARTF_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UARTF_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

